app/controllers/page_controller.rb

SELECT * FROM "articles" WHERE ("articles".category_id = 18)
---
  def index
    articles = Article.find(:all, :order => 'updated_at DESC', :conditions => 'published_date not null')